Revit 2026 API

# ReferencePointGetCoordinateSystem Method

---

The position and orientation of the ReferencePoint.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Transform GetCoordinateSystem()
```
```vb
Public Function GetCoordinateSystem As Transform
```
```cpp
public:
Transform^ GetCoordinateSystem()
```
```fsharp
member GetCoordinateSystem : unit -> Transform
```

#### Return Value

Transform

The position of the point is given by CoordinateSystem.Origin, and the orientation is specified by the three unit vectors CoordinateSystem.BasisX, BasisY, BasisZ.

#### Reference

ReferencePoint Class

Autodesk.Revit.DB Namespace